In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target = df.Survived
inputs=df.drop('Survived',axis='columns')

In [8]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [9]:
inputs =pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:12]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
Name: Age, dtype: float64

In [14]:
inputs.Age =inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [16]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test =train_test_split(inputs,target,test_size=0.2)

In [17]:
len(X_train)

712

In [18]:
len(X_test)

179

In [19]:
len(inputs)

891

# To create gaussian Naive Bayes model:

In [20]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [21]:
model.fit(X_train,y_train)

GaussianNB()

In [22]:
model.score(X_test,y_test)

0.7988826815642458

In [23]:
X_test[:10]

     Pclass        Age      Fare  female  male
710       1  24.000000   49.5042       1     0
619       2  26.000000   10.5000       0     1
855       3  18.000000    9.3500       1     0
883       2  28.000000   10.5000       0     1
772       2  57.000000   10.5000       1     0
400       3  39.000000    7.9250       0     1
598       3  29.699118    7.2250       0     1
861       2  21.000000   11.5000       0     1
817       2  31.000000   37.0042       0     1
550       1  17.000000  110.8833       0     1

In [24]:
y_test[:10]

710    1
619    0
855    1
883    0
772    0
400    1
598    0
861    0
817    0
550    1
Name: Survived, dtype: int64

In [25]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 1, 0, 0, 0, 0, 1])

In [26]:
model.predict_proba(X_test[:10])

array([[0.00516867, 0.99483133],
       [0.97200296, 0.02799704],
       [0.04542154, 0.95457846],
       [0.97295374, 0.02704626],
       [0.03436107, 0.96563893],
       [0.98914878, 0.01085122],
       [0.98761231, 0.01238769],
       [0.96929437, 0.03070563],
       [0.97012803, 0.02987197],
       [0.31098211, 0.68901789]])